print("โปรแกรมคำนวณคะแนน 3 วิชา by มหาเทพชีอุส⚡")

print("--------------------------------------------------------")

th = int(input("คะแนนวิชา ภาษาไทย : "))
st = int(input("คะแนนวิชา STEM : "))
phy = int(input("คะแนนวิชา ฟิสิกส์ : "))

full_total = (th + st + phy)
total = float(full_total /3)

print("--------------------------------------------------------")

print("คะแนนรวมทุกวิชา : ", full_total,"คะแนน")
print("คะแนนรวมเฉลี่ย : ", total,"คะแนน")

print("--------------------------------------------------------")

if total >= 80:
    print("Comment : ดีมาก")
elif total >= 60:
    print("Comment : ดี")
else:
    print("Comment : ควรปรับปรุง")

print("โปรแกรมคำนาณคะแนน 3 วิชา by นาย วิวิศน์ อินทะโพธิ์ เลขที่ 14")
