print("โปรแกรมหาแม่สูตรคูณ")
print("---------------------------------------")
num_s = int(input("สูตรคูณแม่อะไร (จุดเริ่ม) : "))
num_e = int(input("ถึงสูตรคูณแม่อะไร (จุดจบ) : "))
for i in range(num_s,num_e+1):
    print("---------------------------------------")
    print("แม่ :", i)
    for n in range(1,13):
        print(i ,"x",n , "=", i * n)


print("---------------------------------------")
print("โปรแกรมหาแม่สูตรคูณ by best 14")
print("---------------------------------------")