import random

num = random.randint(1,100)
print("-----------------------------------------------")
print("0-- โปรแกรมเดาเลขสุดเท่ --0")
print("-----------------------------------------------")
p_num = 0
#print("-----------------------------------------------")

while p_num != num:
    p_num = int(input("ตัวเลขที่เดา : "))

    if p_num < num:
        print("น้อยไป")
    elif p_num > num:
        print("มากไป")
    else:
        print("ถูกกกกกกกกกต้องงงงงงงงงง")
    print("-----------------------------------------------")



print("ตัวเลขที่เดา : ", p_num)
print("ตัวเลขที่สุ่มมา :", num)

